; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	instrument15 - instrument
	satellite7 - satellite
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	infrared2 - mode
	image3 - mode
	Star3 - direction
	GroundStation0 - direction
	Star4 - direction
	Star5 - direction
	Star2 - direction
	Star1 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star5)
	(supports instrument1 image3)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 spectrograph1)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star1)
	(supports instrument3 image3)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument4 image3)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star3)
	(supports instrument6 image3)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument7 infrared2)
	(supports instrument7 image3)
	(calibration_target instrument7 Star1)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon10)
	(supports instrument9 image3)
	(supports instrument9 spectrograph0)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 Star2)
	(supports instrument10 spectrograph0)
	(supports instrument10 image3)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 Star4)
	(supports instrument11 spectrograph1)
	(supports instrument11 image3)
	(calibration_target instrument11 Star2)
	(calibration_target instrument11 Star3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
	(supports instrument12 image3)
	(calibration_target instrument12 Star4)
	(supports instrument13 image3)
	(supports instrument13 spectrograph1)
	(supports instrument13 infrared2)
	(calibration_target instrument13 Star3)
	(calibration_target instrument13 GroundStation0)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star3)
	(supports instrument14 image3)
	(supports instrument14 spectrograph1)
	(calibration_target instrument14 GroundStation0)
	(calibration_target instrument14 Star2)
	(supports instrument15 image3)
	(calibration_target instrument15 Star1)
	(calibration_target instrument15 Star4)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star3)
	(supports instrument16 infrared2)
	(calibration_target instrument16 Star5)
	(supports instrument17 spectrograph1)
	(supports instrument17 infrared2)
	(supports instrument17 spectrograph0)
	(calibration_target instrument17 Star1)
	(calibration_target instrument17 Star2)
	(supports instrument18 spectrograph0)
	(supports instrument18 image3)
	(supports instrument18 infrared2)
	(calibration_target instrument18 Star1)
	(on_board instrument16 satellite7)
	(on_board instrument17 satellite7)
	(on_board instrument18 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite6 GroundStation0)
	(have_image Star6 spectrograph0)
	(have_image Star7 infrared2)
	(have_image Star8 spectrograph1)
	(have_image Phenomenon9 spectrograph1)
	(have_image Phenomenon10 spectrograph1)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 7
2. (calibrate satellite2 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 0 of 7
3. (turn_to satellite2 star6 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star6)
   goals met: 0 of 7
4. (take_image satellite2 star6 instrument5 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 1 of 7
5. (turn_to satellite2 phenomenon9 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon9)
   goals met: 1 of 7
6. (take_image satellite2 phenomenon9 instrument5 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 2 of 7
7. (turn_to satellite2 phenomenon10 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon10)
   goals met: 2 of 7
8. (turn_to satellite0 groundstation0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 7
9. (take_image satellite2 phenomenon10 instrument5 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 4 of 7
10. (turn_to satellite2 star7 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star7)
   goals met: 4 of 7
11. (take_image satellite2 star7 instrument5 infrared2)
   added: (have_image star7 infrared2)
   goals met: 5 of 7
12. (turn_to satellite2 star8 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star8)
   goals met: 5 of 7
13. (take_image satellite2 star8 instrument5 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 6 of 7
14. (turn_to satellite6 groundstation0 star3)
   deleted: (pointing satellite6 star3)
   added: (pointing satellite6 groundstation0)
   goals met: 7 of 7
